STEPS TO BUILD A ML MODEL

1. LOAD THE DATA
2. PREPROCESS THE DATA INCLUDING REMOVAL OF Nan Values etc
3. DIVIDING THE DATA INTO TRAINING SET & TESTING SET 
4. TRAIN OUR ML MODEL
5. EVALUATE THE ML MODEL ON THE TEST DATA

In [1]:
import pandas as pd;

In [3]:
dataframe = pd.read_csv("titanic.csv");

In [36]:
dataframe.head(2)

   PassengerId  Survived  Pclass  ... Cabin  Embarked  Child
0            2         1       1  ...   C85         0      0
1            4         1       1  ...  C123         2      0

[2 rows x 13 columns]

**SAVING THE PREPROCESSED DATA IN PANDAS**

In [37]:
dataframe.to_csv("titanic2.csv", index=False)

We can Remove Identity Attrbutes like ID, Name , Address etc which add no value to our ML Model

SELECTING ONLY PARTICULAR NUMBER OF COLUMNS FROM VAST DATASET

In [38]:
dataframe.head(1)
#Clearly 13 attribute columns

   PassengerId  Survived  Pclass  ... Cabin  Embarked  Child
0            2         1       1  ...   C85         0      0

[1 rows x 13 columns]

In [47]:
dataframe = dataframe[["Survived","Pclass","Sex","Age","SibSp","Embarked","Child"]]

In [49]:
dataframe.head(3)

   Survived  Pclass  Sex   Age  SibSp  Embarked  Child
0         1       1    0  38.0      1         0      0
1         1       1    0  35.0      1         2      0
2         0       1    1  54.0      0         2      0

THis is How we Selected only required Attribues and Ignored Others BS

dataframe = dataframe[ ["Column Needed"] ]

**Before sending data to ML MODEL we need all Columns into NUMERIC datatype**

For that we can use LABEL ENCODER

we can change sex of male, female to 0 & 1

Embarked Column also is not present as NUMERIC

LABEL ENCODER is used to create labels in the Columns

Sklearn : The libray for traditional machine learning and preprocessing such as Label Encoder, Standardization & Normalization

In [50]:
import sklearn as sk
from sklearn import preprocessing           # import module preprocessing from sklearn

In [51]:
le = preprocessing.LabelEncoder()           # Instance of Label Encoder Created

In [52]:
dataframe["Sex"] = le.fit_transform(dataframe["Sex"]) # Using Instance of Label encoder  to call fir_transorm method to convert as numeric

In [53]:
dataframe.head(4)           # Successfully Coverted to Numeric 
# 0 Stands for Female, 1 - Male

   Survived  Pclass  Sex   Age  SibSp  Embarked  Child
0         1       1    0  38.0      1         0      0
1         1       1    0  35.0      1         2      0
2         0       1    1  54.0      0         2      0
3         1       3    0   4.0      1         2      1

In [55]:
# LET'S convert Embarked also to numeric
le = preprocessing.LabelEncoder()
dataframe["Embarked"] = le.fit_transform(dataframe["Embarked"])

In [56]:
dataframe.head(2)

   Survived  Pclass  Sex   Age  SibSp  Embarked  Child
0         1       1    0  38.0      1         0      0
1         1       1    0  35.0      1         2      0

In [57]:
# Lets Keep everything except Survived as Input so keep it on X Axis 
# Survived Gonna be Output so keep it on Y axis 

X =  dataframe.drop("Survived", axis = 1)
Y = dataframe["Survived"]

NOW SPLIT DATA INTO TRAINING & TESTING DATA USING model_selection

In [58]:
from sklearn.model_selection import train_test_split

In [59]:
X_train, X_test , Y_train, Y_test = train_test_split(X,Y)

# WE used train_test_split() to split our X & Y columns into 4 variables namely
# X_train Y_train
# X_test  Y_split

**KNN ML MODEL**

In [60]:
 from sklearn.neighbors import KNeighborsClassifier

model.fit(X,Y) to train our model 

Training the KNN model

In [61]:
model = KNeighborsClassifier (n_neighbors = 3)
# Here 3 is value of k which is calculated using algo method 
model.fit(X_train,Y_train)

KNeighborsClassifier(algorithm='auto', leaf_size=30, metric='minkowski',
                     metric_params=None, n_jobs=None, n_neighbors=3, p=2,
                     weights='uniform')

TESTING THE KNN Model

model.predict(X,Y)

In [62]:
# we will save the predicted values in Y_predicted and then compare it with Y_test to get the accuracy

Y_predicted =   model.predict(X_test)

In [64]:
from sklearn.metrics import accuracy_score

In [65]:
print(accuracy_score(Y_predicted, Y_test)*100)

76.08695652173914